# เส้นทางของ graph
# key คือ vertex
# value คือ vertex ที่เชื่อมต่อกันด้วยเส้น edge กับ vertex ของ key (neighbor)

# ? ทุก graphs ที่อยู่ใน module นี้เป็น Undirected Graphs ทั้งหมด
# กราฟอันที่ 1
graph = {
    "A": ["B", "C"],
    "B": ["A", "D"],
    "C": ["A", "D"],
    "D": ["B", "C", "E"],
    "E": ["D"],
}

# กราฟอันที่ 2
graph2 = {
    "A": ["B", "G"],
    "B": ["A", "G", "C"],
    "C": ["B", "E"],
    "E": ["C", "G", "J", "K"],
    "G": ["B", "E", "J"],
    "J": ["G", "E", "D", "F"],
    "D": ["J", "F", "K"],
    "F": ["J", "D", "K"],
    "K": ["E", "D", "F"],
}

# กราฟอันที่ 3
graph3 = {
    "A": ["B", "C"],
    "B": ["A", "D", "E"],
    "D": ["B", "H", "I"],
    "H": ["D"],
    "I": ["D"],
    "E": ["B"],
    "C": ["F", "G"],
    "F": ["C"],
    "G": ["J", "C"],
    "J": ["K", "G"],
    "K": ["J"],
}
